In [13]:
#importing modules
import pandas as pd
import numpy as np

In [14]:
# create dictionary
dict1 = {
    'name' : ['Dhrupal','Nikunj','Vipul','Mehul'],
    'marks' : [26, 27, 25, 23],
    'city' : ['Mehsana','Visnagar','Somnath','Vijapur']
}

In [15]:
# create dataframe
df = pd.DataFrame(dict1)
df

      name  marks      city
0  Dhrupal     26   Mehsana
1   Nikunj     27  Visnagar
2    Vipul     25   Somnath
3    Mehul     23   Vijapur

In [16]:
# change index
df.index = ['I','II','III','IV']

In [17]:
df

        name  marks      city
I    Dhrupal     26   Mehsana
II    Nikunj     27  Visnagar
III    Vipul     25   Somnath
IV     Mehul     23   Vijapur

In [19]:
# reset the index
df.reset_index(drop=True,inplace=True)

In [20]:
df

      name  marks      city
0  Dhrupal     26   Mehsana
1   Nikunj     27  Visnagar
2    Vipul     25   Somnath
3    Mehul     23   Vijapur

In [21]:
# write data to csv file
df.to_csv('friends_data.csv')

In [22]:
# show uppermost data using head
df.head(2)

      name  marks      city
0  Dhrupal     26   Mehsana
1   Nikunj     27  Visnagar

In [23]:
# show lowermost data using tail
df.tail(2)

    name  marks     city
2  Vipul     25  Somnath
3  Mehul     23  Vijapur

In [66]:
# to have statstical summary of numerical fields
df.describe()

               1          2          3          4
count  10.000000  10.000000  10.000000  10.000000
mean    0.577533   0.359415   0.514822   0.533384
std     0.289140   0.238371   0.320721   0.380487
min     0.029149   0.002009   0.087985   0.004178
25%     0.406279   0.255879   0.283225   0.210249
50%     0.621382   0.409251   0.507054   0.575028
75%     0.790302   0.442830   0.798419   0.884794
max     0.961763   0.705562   0.960049   0.937812

In [26]:
dict2 = {
    'car' : ['i20','i10','bmw','mercedeze'],
    'speed': [100,80,160,180],
    'pricec' : [8,4,30,35]
}

In [70]:
df2 = pd.DataFrame(dict2)
df2

         car  speed  pricec
0        i20    100       8
1        i10     80       4
2        bmw    160      30
3  mercedeze    180      35

In [71]:
#write data to csv without index as a column
df2.to_csv('car_details.csv',index=False)

In [32]:
df3 = pd.read_csv('car_details.csv')

In [33]:
df3

         car  speed  pricec
0        i20    100       8
1        i10     80       4
2        bmw    160      30
3  mercedeze    180      35

In [72]:
# access particular column
df3['speed']

0    110
1     80
2    160
3    180
Name: speed, dtype: int64

In [35]:
# access data
df3['speed'][0]

100

In [73]:
# change data
df3['speed'][0] = 110

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

In [37]:
df3

         car  speed  pricec
0        i20    110       8
1        i10     80       4
2        bmw    160      30
3  mercedeze    180      35

In [38]:
# series 1-D array in pandas
series = pd.Series([1,2,3,4])
series

0    1
1    2
2    3
3    4
dtype: int64

In [39]:
# check type of Series
type(series)

pandas.core.series.Series

In [40]:
# dataframe 2-D array in pandas (collections of 1 or more series)
df = pd.DataFrame([1,2,3,4,5])

In [41]:
df

   0
0  1
1  2
2  3
3  4
4  5

In [42]:
type(df)

pandas.core.frame.DataFrame

In [43]:
df = pd.DataFrame(np.random.rand(10,5),index=np.arange(0,10))
df

          0         1         2         3         4
0  0.801897  0.029149  0.406246  0.519089  0.850062
1  0.253377  0.794112  0.262205  0.112366  0.937812
2  0.928544  0.322402  0.253770  0.598446  0.179741
3  0.677665  0.778870  0.422084  0.912409  0.347103
4  0.836882  0.775040  0.412256  0.087985  0.004178
5  0.853440  0.390238  0.705562  0.865077  0.094738
6  0.783176  0.961763  0.004423  0.960049  0.802953
7  0.480077  0.801624  0.675848  0.267560  0.301772
8  0.022622  0.467723  0.002009  0.330221  0.896371
9  0.102215  0.454404  0.449745  0.495020  0.919107

In [44]:
df.describe()

               0          1          2          3          4
count  10.000000  10.000000  10.000000  10.000000  10.000000
mean    0.573990   0.577533   0.359415   0.514822   0.533384
std     0.336246   0.289140   0.238371   0.320721   0.380487
min     0.022622   0.029149   0.002009   0.087985   0.004178
25%     0.310052   0.406279   0.255879   0.283225   0.210249
50%     0.730420   0.621382   0.409251   0.507054   0.575028
75%     0.828136   0.790302   0.442830   0.798419   0.884794
max     0.928544   0.961763   0.705562   0.960049   0.937812

In [45]:
df

          0         1         2         3         4
0  0.801897  0.029149  0.406246  0.519089  0.850062
1  0.253377  0.794112  0.262205  0.112366  0.937812
2  0.928544  0.322402  0.253770  0.598446  0.179741
3  0.677665  0.778870  0.422084  0.912409  0.347103
4  0.836882  0.775040  0.412256  0.087985  0.004178
5  0.853440  0.390238  0.705562  0.865077  0.094738
6  0.783176  0.961763  0.004423  0.960049  0.802953
7  0.480077  0.801624  0.675848  0.267560  0.301772
8  0.022622  0.467723  0.002009  0.330221  0.896371
9  0.102215  0.454404  0.449745  0.495020  0.919107

In [46]:
type(df)

pandas.core.frame.DataFrame

In [47]:
# datatypes of all columns
df.dtypes

0    float64
1    float64
2    float64
3    float64
4    float64
dtype: object

In [50]:
# change content of row1-col1 data
df[0][0]= 'abc'

In [51]:
df.dtypes

0     object
1    float64
2    float64
3    float64
4    float64
dtype: object

In [58]:
df[0][0]=np.random.rand()

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [59]:
# all index
df.index

Int64Index([0, 1, 2, 3, 4, 5, 6, 7, 8, 9], dtype='int64')

In [60]:
# all columns
df.columns

RangeIndex(start=0, stop=5, step=1)

In [61]:
df

           0         1         2         3         4
0   0.730193  0.029149  0.406246  0.519089  0.850062
1   0.253377  0.794112  0.262205  0.112366  0.937812
2   0.928544  0.322402  0.253770  0.598446  0.179741
3   0.677665  0.778870  0.422084  0.912409  0.347103
4   0.836882  0.775040  0.412256  0.087985  0.004178
5    0.85344  0.390238  0.705562  0.865077  0.094738
6   0.783176  0.961763  0.004423  0.960049  0.802953
7   0.480077  0.801624  0.675848  0.267560  0.301772
8  0.0226223  0.467723  0.002009  0.330221  0.896371
9   0.102215  0.454404  0.449745  0.495020  0.919107

In [63]:
# to convert dataframe to numpy array
df.to_numpy()

array([[0.7301931095320321, 0.02914933750659343, 0.4062455024070467,
        0.5190885988515962, 0.8500623793644516],
       [0.2533768165759599, 0.7941122648776723, 0.26220480374753785,
        0.11236570582332983, 0.9378121529154944],
       [0.9285438920990714, 0.3224017255528452, 0.2537704203160073,
        0.5984458202502033, 0.17974124063595054],
       [0.6776651911353296, 0.7788702844408202, 0.4220844678737552,
        0.9124088510607781, 0.34710254735023316],
       [0.8368819633584552, 0.7750401069741333, 0.4122560328224846,
        0.08798529383631115, 0.004177679833039405],
       [0.853440221257549, 0.3902375747737761, 0.7055615545811508,
        0.8650768668407006, 0.09473848264243112],
       [0.7831755630496244, 0.9617631658580669, 0.004423314893002295,
        0.9600485827232037, 0.8029527625293854],
       [0.480077452861408, 0.8016243522665462, 0.6758483097179669,
        0.2675600305081507, 0.3017722606924804],
       [0.02262229595256271, 0.4677232064450767, 0.0020092998798955097,
        0.33022071834397926, 0.8963705896353006],
       [0.10221531981321985, 0.45440446289927494, 0.4497445776794019,
        0.49502019071113135, 0.9191074825642455]], dtype=object)

In [64]:
# transpose dataframe like array
df.T

,0,1,2,3,4,5,6,7,8,9
0,0.730193,0.253377,0.928544,0.677665,0.836882,0.85344,0.783176,0.480077,0.0226223,0.102215
1,0.0291493,0.794112,0.322402,0.77887,0.77504,0.390238,0.961763,0.801624,0.467723,0.454404
2,0.406246,0.262205,0.25377,0.422084,0.412256,0.705562,0.00442331,0.675848,0.0020093,0.449745
3,0.519089,0.112366,0.598446,0.912409,0.0879853,0.865077,0.960049,0.26756,0.330221,0.49502
4,0.850062,0.937812,0.179741,0.347103,0.00417768,0.0947385,0.802953,0.301772,0.896371,0.919107

In [65]:
df

           0         1         2         3         4
0   0.730193  0.029149  0.406246  0.519089  0.850062
1   0.253377  0.794112  0.262205  0.112366  0.937812
2   0.928544  0.322402  0.253770  0.598446  0.179741
3   0.677665  0.778870  0.422084  0.912409  0.347103
4   0.836882  0.775040  0.412256  0.087985  0.004178
5    0.85344  0.390238  0.705562  0.865077  0.094738
6   0.783176  0.961763  0.004423  0.960049  0.802953
7   0.480077  0.801624  0.675848  0.267560  0.301772
8  0.0226223  0.467723  0.002009  0.330221  0.896371
9   0.102215  0.454404  0.449745  0.495020  0.919107